validation/slipTurb/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
scale 1;
vertices
(
    (0.25 -0.433 0) (2.848 1.067 0) (2.348 1.933 0) (-0.25 0.433 0)
    (0.25 -0.433 0.1) (2.848 1.067 0.1) (2.348 1.933 0.1) (-0.25 0.433 0.1)
);
blocks ( hex (0 1 2 3 4 5 6 7) (90 30 1) simpleGrading (1 1 1) );
edges ();
boundary
(
    inlet  { type patch; faces ( (0 3 7 4) ); }
    outlet { type patch; faces ( (1 2 6 5) ); }
    bottom { type wall;  faces ( (0 1 5 4) ); }
    top    { type wall;  faces ( (3 2 6 7) ); }
    frontAndBack { type empty; faces ( (0 3 2 1) (4 5 6 7) ); }
);
mergePatchPairs ();
