validation/slipTurb/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       5280;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       5310;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       5340;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       5430;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          5400;
        startFace       5520;
    }
)

// ************************************************************************* //
